ycsb/logs/RDMA_BP_16_async_th_28/workloada.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 16494531, 0.000000
[OVERALL], RunTime(ms), 5339
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18730.09926952613
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 51.90476
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 4979
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 113
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5642.0
[CLEANUP], MinLatency(us), 5640
[CLEANUP], MaxLatency(us), 5643
[CLEANUP], 95thPercentileLatency(us), 5643
[CLEANUP], 99thPercentileLatency(us), 5643
total zerocopy send size = 0, total send size = 16521200, 0.000000
total zerocopy send size = 0, total send size = 16513519, 0.000000
[OVERALL], RunTime(ms), 5413
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18474.043968224643
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 52.71956
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 4963
[READ], 95thPercentileLatency(us), 86
[READ], 99thPercentileLatency(us), 114
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2643.0
[CLEANUP], MinLatency(us), 2642
[CLEANUP], MaxLatency(us), 2643
[CLEANUP], 95thPercentileLatency(us), 2643
[CLEANUP], 99thPercentileLatency(us), 2643
[OVERALL], RunTime(ms), 5412
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18477.457501847744
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 52.62921
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5163
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 112
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5494.0
[CLEANUP], MinLatency(us), 5492
[CLEANUP], MaxLatency(us), 5495
[CLEANUP], 95thPercentileLatency(us), 5495
[CLEANUP], 99thPercentileLatency(us), 5495
total zerocopy send size = 0, total send size = 16498790, 0.000000
[OVERALL], RunTime(ms), 5417
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18460.40243677312
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 52.74593
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5027
[READ], 95thPercentileLatency(us), 84
[READ], 99thPercentileLatency(us), 112
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2093.0
[CLEANUP], MinLatency(us), 2092
[CLEANUP], MaxLatency(us), 2093
[CLEANUP], 95thPercentileLatency(us), 2093
[CLEANUP], 99thPercentileLatency(us), 2093
total zerocopy send size = 0, total send size = 16495041, 0.000000
total zerocopy send size = 0, total send size = 16508423, 0.000000
total zerocopy send size = 0, total send size = 16521898, 0.000000
[OVERALL], RunTime(ms), 5492
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18208.30298616169
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 53.44881
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5139
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 111
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5646.0
[CLEANUP], MinLatency(us), 5644
[CLEANUP], MaxLatency(us), 5647
[CLEANUP], 95thPercentileLatency(us), 5647
[CLEANUP], 99thPercentileLatency(us), 5647
[OVERALL], RunTime(ms), 5508
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18155.410312273056
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 53.66752
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5175
[READ], 95thPercentileLatency(us), 86
[READ], 99thPercentileLatency(us), 113
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1989.0
[CLEANUP], MinLatency(us), 1989
[CLEANUP], MaxLatency(us), 1989
[CLEANUP], 95thPercentileLatency(us), 1989
[CLEANUP], 99thPercentileLatency(us), 1989
[OVERALL], RunTime(ms), 5491
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18211.61901293025
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 53.50866
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5135
[READ], 95thPercentileLatency(us), 86
[READ], 99thPercentileLatency(us), 113
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2429.0
[CLEANUP], MinLatency(us), 2428
[CLEANUP], MaxLatency(us), 2429
[CLEANUP], 95thPercentileLatency(us), 2429
[CLEANUP], 99thPercentileLatency(us), 2429
total zerocopy send size = 0, total send size = 16496672, 0.000000
[OVERALL], RunTime(ms), 5495
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18198.362147406733
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 53.52969
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5627
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2079.0
[CLEANUP], MinLatency(us), 2078
[CLEANUP], MaxLatency(us), 2079
[CLEANUP], 95thPercentileLatency(us), 2079
[CLEANUP], 99thPercentileLatency(us), 2079
total zerocopy send size = 0, total send size = 16518119, 0.000000
total zerocopy send size = 0, total send size = 16510637, 0.000000
[OVERALL], RunTime(ms), 5529
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 18086.45324651836
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 53.8816
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5151
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 114
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1896.0
[CLEANUP], MinLatency(us), 1896
[CLEANUP], MaxLatency(us), 1896
[CLEANUP], 95thPercentileLatency(us), 1896
[CLEANUP], 99thPercentileLatency(us), 1896
[OVERALL], RunTime(ms), 5556
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17998.560115190783
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 54.12773
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5167
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 114
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1856.0
[CLEANUP], MinLatency(us), 1856
[CLEANUP], MaxLatency(us), 1856
[CLEANUP], 95thPercentileLatency(us), 1856
[CLEANUP], 99thPercentileLatency(us), 1856
total zerocopy send size = 0, total send size = 16501117, 0.000000
total zerocopy send size = 0, total send size = 16494307, 0.000000
[OVERALL], RunTime(ms), 5568
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17959.77011494253
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 54.17803
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5019
[READ], 95thPercentileLatency(us), 86
[READ], 99thPercentileLatency(us), 114
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2385.0
[CLEANUP], MinLatency(us), 2384
[CLEANUP], MaxLatency(us), 2385
[CLEANUP], 95thPercentileLatency(us), 2385
[CLEANUP], 99thPercentileLatency(us), 2385
[OVERALL], RunTime(ms), 5599
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17860.33220217896
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 54.58039
[READ], MinLatency(us), 27
[READ], MaxLatency(us), 5191
[READ], 95thPercentileLatency(us), 86
[READ], 99thPercentileLatency(us), 116
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2179.0
[CLEANUP], MinLatency(us), 2178
[CLEANUP], MaxLatency(us), 2179
[CLEANUP], 95thPercentileLatency(us), 2179
[CLEANUP], 99thPercentileLatency(us), 2179
total zerocopy send size = 0, total send size = 16505673, 0.000000
total zerocopy send size = 0, total send size = 16496209, 0.000000
[OVERALL], RunTime(ms), 5608
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17831.66904422254
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 54.70483
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 5027
[READ], 95thPercentileLatency(us), 88
[READ], 99thPercentileLatency(us), 115
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2159.0
[CLEANUP], MinLatency(us), 2158
[CLEANUP], MaxLatency(us), 2159
[CLEANUP], 95thPercentileLatency(us), 2159
[CLEANUP], 99thPercentileLatency(us), 2159
[OVERALL], RunTime(ms), 5639
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17733.640716439084
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 54.98863
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5179
[READ], 95thPercentileLatency(us), 88
[READ], 99thPercentileLatency(us), 116
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1985.0
[CLEANUP], MinLatency(us), 1985
[CLEANUP], MaxLatency(us), 1985
[CLEANUP], 95thPercentileLatency(us), 1985
[CLEANUP], 99thPercentileLatency(us), 1985
total zerocopy send size = 0, total send size = 16503897, 0.000000
[OVERALL], RunTime(ms), 5689
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17577.781683951485
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 55.46318
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 5135
[READ], 95thPercentileLatency(us), 89
[READ], 99thPercentileLatency(us), 117
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2281.0
[CLEANUP], MinLatency(us), 2280
[CLEANUP], MaxLatency(us), 2281
[CLEANUP], 95thPercentileLatency(us), 2281
[CLEANUP], 99thPercentileLatency(us), 2281
total zerocopy send size = 0, total send size = 16503108, 0.000000
[OVERALL], RunTime(ms), 5707
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17522.340984755563
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 55.65886
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 4995
[READ], 95thPercentileLatency(us), 88
[READ], 99thPercentileLatency(us), 116
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1928.0
[CLEANUP], MinLatency(us), 1928
[CLEANUP], MaxLatency(us), 1928
[CLEANUP], 95thPercentileLatency(us), 1928
[CLEANUP], 99thPercentileLatency(us), 1928